## Staging: lambdas
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 4 to add, 5 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                    NAME                                    |
|--------|----------------------------------------------------------------------------|
| update | `aws_cloudwatch_event_rule.audit_logs_archiver_lambda_trigger`             |
|        | `aws_cloudwatch_event_rule.form_archiver_lambda_trigger`                   |
|        | `aws_cloudwatch_event_rule.nagware_lambda_trigger`                         |
|        | `aws_cloudwatch_event_rule.reliability_dlq_lambda_trigger`                 |
|        | `aws_cloudwatch_event_rule.response_archiver_lambda_trigger`               |
| add    | `aws_cloudwatch_event_rule.api_end_to_end_test_lambda_trigger`             |
|        | `aws_cloudwatch_event_target.api_end_to_end_test_lambda_trigger`           |
|        | `aws_lambda_function.api_end_to_end_test`                                  |
|        | `aws_lambda_permission.allow_cloudwatch_to_run_api_end_to_end_test_lambda` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_cloudwatch_event_rule.api_end_to_end_test_lambda_trigger will be created
  + resource "aws_cloudwatch_event_rule" "api_end_to_end_test_lambda_trigger" {
      + arn                 = (known after apply)
      + description         = "Fires every day at 5 AM EST"
      + event_bus_name      = "default"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "api-end-to-end-test-lambda-trigger"
      + name_prefix         = (known after apply)
      + schedule_expression = "cron(0 9 * * ? *)"
      + tags_all            = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
    }

  # aws_cloudwatch_event_rule.audit_logs_archiver_lambda_trigger will be updated in-place
  ~ resource "aws_cloudwatch_event_rule" "audit_logs_archiver_lambda_trigger" {
      ~ description         = "Fires every day at 1am EST" -> "Fires every day at 2 AM EST"
        id                  = "audit-logs-archiver-lambda-trigger"
        name                = "audit-logs-archiver-lambda-trigger"
        tags                = {}
        # (9 unchanged attributes hidden)
    }

  # aws_cloudwatch_event_rule.form_archiver_lambda_trigger will be updated in-place
  ~ resource "aws_cloudwatch_event_rule" "form_archiver_lambda_trigger" {
      ~ description         = "Fires every day at 4am EST" -> "Fires every day at 5 AM EST"
        id                  = "form-archiver-lambda-trigger"
        name                = "form-archiver-lambda-trigger"
        tags                = {}
        # (9 unchanged attributes hidden)
    }

  # aws_cloudwatch_event_rule.nagware_lambda_trigger will be updated in-place
  ~ resource "aws_cloudwatch_event_rule" "nagware_lambda_trigger" {
      ~ description         = "Fires every day at 5am EST" -> "Fires every day at 6 AM EST"
        id                  = "nagware-lambda-trigger"
        name                = "nagware-lambda-trigger"
        tags                = {}
        # (9 unchanged attributes hidden)
    }

  # aws_cloudwatch_event_rule.reliability_dlq_lambda_trigger will be updated in-place
  ~ resource "aws_cloudwatch_event_rule" "reliability_dlq_lambda_trigger" {
      ~ description         = "Fires every day at 2am EST" -> "Fires every day at 3 AM EST"
        id                  = "reliability-dlq-lambda-trigger"
        name                = "reliability-dlq-lambda-trigger"
        tags                = {}
        # (9 unchanged attributes hidden)
    }

  # aws_cloudwatch_event_rule.response_archiver_lambda_trigger will be updated in-place
  ~ resource "aws_cloudwatch_event_rule" "response_archiver_lambda_trigger" {
      ~ description         = "Fires every day at 3am EST" -> "Fires every day at 4 AM EST"
        id                  = "response-archiver-lambda-trigger"
        name                = "response-archiver-lambda-trigger"
        tags                = {}
        # (9 unchanged attributes hidden)
    }

  # aws_cloudwatch_event_target.api_end_to_end_test_lambda_trigger will be created
  + resource "aws_cloudwatch_event_target" "api_end_to_end_test_lambda_trigger" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + force_destroy  = false
      + id             = (known after apply)
      + rule           = "api-end-to-end-test-lambda-trigger"
      + target_id      = (known after apply)
    }

  # aws_lambda_function.api_end_to_end_test will be created
  + resource "aws_lambda_function" "api_end_to_end_test" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + function_name                  = "api-end-to-end-test"
      + id                             = (known after apply)
      + image_uri                      = "test_url:latest"
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Image"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::687401027353:role/iam_for_lambda"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + timeout                        = 300
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "API_PRIVATE_KEY"        = jsonencode(
                    {
                      + formId = "cmacoc5ga0001yk01zgn888l9"
                      + key    = <<-EOT
                            -----BEGIN PRIVATE KEY-----
                            MIIEvgIBADANBgkqhkiG9w0BAQEFAASCBKgwggSkAgEAAoIBAQC9ackYsiDs5I83
                            f+Tl8HWHmlbhMxIAyvuDYSdtBcjui5ItiKbYnMRkuEX0HTcm0UUSFgASa9zusMPF
                            HT2Uc+Sfei41Qw4bsqDaCS2ije/gW7tmJnxNEAqsmWC7VlU0hQzY6v/6R9voDpoI
                            AOgrcc1hgFnnlTrl7R+BKOCsRuL2EXvVBbAuaLEO7lnW5sAexoO1RWs+yMUTp1sC
                            ISf5DG9cmSOP/mH2ERLlrSEj8L5c87HIo2usrBhbi0JemgOPPK+f1SnJck5LxwB1
                            tA0nT5BRtIeM0xhCep1y7jHxG+xPKQ5q7SjcqgLeyqB+yc9g1lpJmn0bXKz98vVO
                            HStNaVj1AgMBAAECggEAE4YaKZ7AyJJFleOrsSzgPHZC8ssMFcNWegQTZ4gzXi1K
                            R8HAau77ymL5KPCy/OAQxcy5PKzcFMlpIIIDVTA99ldGeIx9IYs/y8Gq78jAG0jx
                            T9XzNZFL/F8B6sV7GmMFgD123bI2/1wz8dPAGqxMDnsHqViHPeh7eRmA0Rksb08P
                            o8YuRlPhkWaVGJPYH61Qt5U2jtbVcFMyxnDuPmOk5aRPFaOK423MaV6CJtLhl0ys
                            OvWdFs7kvxOtRdmXFMGU6SRRdeqOOoFsSZjFL3mOMn3ABW2pp7yVrpFuZwr/GDax
                            EWzAKNQeI9Egro4Vhr2szUIrgKmm1vfYGkv/JuqLeQKBgQD/zM5YT6ShxXeOCpLp
                            KrmFflkOF4UMNSvktEr/rZiOhMPsYJtto50w6U0JhuJKC1jEIFtFbKAtwxRySwNr
                            YDexhTriCHOmObJR0j8IgVuNTQO3U3BazWWokTdu6qm1lMPNNbIIb6u5Owig2pQO
                            iYk8Y3dziQrf7kp+6GZYwv0kSQKBgQC9j7F9unleqO3Rygl6rLaG3RBhDgK6iju3
                            bH8XwBLhhhxgY9cC4Bo+p78DONtkYszYqF995e3wL7iimYnYTQIk33wof9c11sRg
                            wrNWcD6pSYgVbQDP/hZfDWKh/9i1gLJh3Fx2fry/N0TiLfQYN8mWCIKQf62Yea0G
                            vVO0ySv3TQKBgH46PojtpDwACaMaLKzK3Im3c5K0oH8JrgNJxMiujV2mvlfixFAy
                            MNt2BQHygbAwMTl3DhMQK2rpnSlZQvK1pEYBjLEFoqwgRJKDwX8c9mSf4HmSvxrP
                            yJ6KKmSdf+mO46BcIuJu2LqrGvLlabJSxFn8a3Gj6q3eFPzTCc47SlehAoGBAIlL
                            iQeCRyPbgJyBE8qJS450kMdq6WkIc+YPLCIcmNBFXUonJfTMMdYNkxiXVrfno2yM
                            ztUV8vcS6UzDngZPCG2CfJ+ssEgrbIKUomXJ2GiufGTgVUVQSA3CWRzyfJhBRXIB
                            s+qTMsvgEQEsvW3JAjWrpj1YbHhSMJMAD5+SUUjFAoGBAPimcNSZLtQM5emzxs82
                            LIBwOSCLiOnadznxGSqAI3/O8TPJK+6Zg15q2+5gdZt/Foy8McC70pnsa0QQcRK9
                            N9rLGKxKddVRGpWCv6PueFHExQjeLnKBN2G0eu2C98yj4jxN39Q35jHi1TnQ1LK0
                            +c3BtqB7+g0EyycEwjQntUI+
                            -----END PRIVATE KEY-----
                        EOT
                      + keyId  = "318850893963332618"
                      + type   = "serviceAccount"
                      + userId = "318850893040585738"
                    }
                )
              + "API_URL"                = "forms-api.ecs.local:3001"
              + "FORM_ID"                = "cmacoc5ga0001yk01zgn888l9"
              + "IDP_PROJECT_IDENTIFIER" = "2.75372254274007E+17"
              + "IDP_URL"                = "zitadel.ecs.local:8080"
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config {
          + mode = "PassThrough"
        }

      + vpc_config {
          + ipv6_allowed_for_dual_stack = false
          + security_group_ids          = [
              + "sg-06651d69cd4d3c50f",
            ]
          + subnet_ids                  = [
              + "subnet-07e38df0760d389d1",
              + "subnet-07f9debd31e48ce64",
              + "subnet-0af8e6e3cf80f582d",
            ]
          + vpc_id                      = (known after apply)
        }
    }

  # aws_lambda_permission.allow_cloudwatch_to_run_api_end_to_end_test_lambda will be created
  + resource "aws_lambda_permission" "allow_cloudwatch_to_run_api_end_to_end_test_lambda" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "api-end-to-end-test"
      + id                  = (known after apply)
      + principal           = "events.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowExecutionFromCloudWatch"
      + statement_id_prefix = (known after apply)
    }

Plan: 4 to add, 5 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.api_end_to_end_test_lambda_trigger"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.audit_logs_archiver_lambda_trigger"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.form_archiver_lambda_trigger"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.nagware_lambda_trigger"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.reliability_dlq_lambda_trigger"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.response_archiver_lambda_trigger"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.archive_form_templates"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.audit_logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.audit_logs_archiver"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.dead_letter_queue_consumer"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.nagware"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.prisma_migration_handler"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.reliability"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.response_archiver"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.submission"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.vault_integrity"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_dynamodb"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_kms"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_logging"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_rds"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_s3"]
WARN - plan.json - main -...
```

</details>
